
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12740522063)


<pre><code>Plan: 14 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_route_table.this[&#34;app&#34;]
  * aws_route_table.this[&#34;db&#34;]
  * aws_route_table.this[&#34;ingress&#34;]
  * aws_route_table_association.this[&#34;app_private_app_1a&#34;]
  * aws_route_table_association.this[&#34;app_private_app_1c&#34;]
  * aws_route_table_association.this[&#34;db_private_db_1a&#34;]
  * aws_route_table_association.this[&#34;db_private_db_1c&#34;]
  * aws_route_table_association.this[&#34;ingress_public_ingress_1a&#34;]
  * aws_route_table_association.this[&#34;ingress_public_ingress_1c&#34;]
  * aws_route_table_association.this[&#34;ingress_public_management_1a&#34;]
  * aws_route_table_association.this[&#34;ingress_public_management_1c&#34;]
  * aws_security_group.this[&#34;database&#34;]
  * aws_security_group.this[&#34;ingress&#34;]
  * aws_security_group.this[&#34;management&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_route_table.this["app"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app"
        }
      + tags_all         = {
          + "Managed" = "Terraform"
          + "Name"    = "app"
        }
      + vpc_id           = "vpc-09b0c706d486d2aeb"
    }

  # aws_route_table.this["db"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "db"
        }
      + tags_all         = {
          + "Managed" = "Terraform"
          + "Name"    = "db"
        }
      + vpc_id           = "vpc-09b0c706d486d2aeb"
    }

  # aws_route_table.this["ingress"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = "igw-02f70bef3ab40bbc1"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "ingress"
        }
      + tags_all         = {
          + "Managed" = "Terraform"
          + "Name"    = "ingress"
        }
      + vpc_id           = "vpc-09b0c706d486d2aeb"
    }

  # aws_route_table_association.this["app_private_app_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0c6e62a6d5730715f"
    }

  # aws_route_table_association.this["app_private_app_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03ce245afed54dd38"
    }

  # aws_route_table_association.this["db_private_db_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-015dfa7d35acfa633"
    }

  # aws_route_table_association.this["db_private_db_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0f47daefe06401be8"
    }

  # aws_route_table_association.this["ingress_public_ingress_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0e08cb0bbe084719c"
    }

  # aws_route_table_association.this["ingress_public_ingress_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0b3a48f92d667ffc1"
    }

  # aws_route_table_association.this["ingress_public_management_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0390a8a4763d9c950"
    }

  # aws_route_table_association.this["ingress_public_management_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0b4dbc3e2c147c86e"
    }

  # aws_security_group.this["database"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "database"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "database"
        }
      + tags_all               = {
          + "Managed" = "Terraform"
          + "Name"    = "database"
        }
      + vpc_id                 = "vpc-09b0c706d486d2aeb"
    }

  # aws_security_group.this["ingress"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ingress"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ingress"
        }
      + tags_all               = {
          + "Managed" = "Terraform"
          + "Name"    = "ingress"
        }
      + vpc_id                 = "vpc-09b0c706d486d2aeb"
    }

  # aws_security_group.this["management"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "management"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "management"
        }
      + tags_all               = {
          + "Managed" = "Terraform"
          + "Name"    = "management"
        }
      + vpc_id                 = "vpc-09b0c706d486d2aeb"
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"c930e02a06c5ac5650d9de1486276037c9a3a2b5","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->